**Data Analysis Tools Analytics**

# Setup

In [1]:
# install pymsql library for connection
# pip install pymysql

## Imports

In [2]:
# import libraries
import pandas as pd
from sqlalchemy import create_engine
import pymysql

## Create connection

In [3]:
# create engine
engine = create_engine('mysql+pymysql://root:password@localhost/vgsales2016')
# connection string
conn = engine.connect()

## Load data

In [4]:
# read table vgsales-2016 into DataFrame
df = pd.read_sql("SELECT * FROM `vgsales-2016`", conn)
print(df.shape)
# display data columns
df.head(2)

(16450, 16)

,Name,Platform,Year_of_Release,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales,Critic_Score,Critic_Count,User_Score,User_Count,Developer,Rating
0,Wii Sports,Wii,2006,Sports,Nintendo,41.36,28.96,3.77,8.45,82.53,76,51,8,322,Nintendo,E
1,Super Mario Bros.,NES,1985,Platform,Nintendo,29.08,3.58,6.81,0.77,40.24,,,,,,

## Was the average of global sales higher before or after 2005?

In [5]:
# write query
query = """
SELECT 
    ROUND(AVG(Global_Sales), 2) AS average_global_sales,
    CASE
        WHEN Year_of_Release < 2005 THEN 'pre-2005'
        ELSE 'post-2005'
    END AS pre_or_post_2005
FROM `vgsales-2016`
GROUP BY 2
ORDER By average_global_sales DESC
LIMIT 1;
"""
# query vgsales-2016 and store result in DataFrame
average_global_sales = pd.read_sql(query, conn)
average_global_sales.head(3)

   average_global_sales pre_or_post_2005
0                  0.65         pre-2005

## Create a new column that labels records before 2005 as 'pre-2005' and after 2005 as 'post-2005'

In [6]:
# write query
query = """
SELECT *,
    CASE
        WHEN Year_of_Release < 2005 THEN 'pre-2005'
        ELSE 'post-2005'
    END AS pre_or_post_2005
FROM `vgsales-2016`;
"""
# query vgsales-2016 and store result in DataFrame
pre_or_post_2005 = pd.read_sql(query, conn)
pre_or_post_2005.head(3)

,Name,Platform,Year_of_Release,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales,Critic_Score,Critic_Count,User_Score,User_Count,Developer,Rating,pre_or_post_2005
0,Wii Sports,Wii,2006,Sports,Nintendo,41.36,28.96,3.77,8.45,82.53,76,51,8,322,Nintendo,E,post-2005
1,Super Mario Bros.,NES,1985,Platform,Nintendo,29.08,3.58,6.81,0.77,40.24,,,,,,,pre-2005
2,Mario Kart Wii,Wii,2008,Racing,Nintendo,15.68,12.76,3.79,3.29,35.52,82,73,8.3,709,Nintendo,E,post-2005